Courses/4420/Lectures/Viruses/viruses.org

# -*- mode: org -*-
# -*- org-export-html-postamble:t; -*-
#+TITLE: Malware: Viruses, Worms, Trojans, ...
#+AUTHOR: Prabhaker Mateti
#+STARTUP:showeverything
#+OPTIONS: toc:t
#+LINK_HOME: ../Top/index.html
#+DESCRIPTION: Computer Security: Viruses, Worms, and Trojans
#+STYLE: <style> P {text-align: justify} li { text-align: justify; } code {font-family: monospace; font-size: 10pt;color: brown;} @media screen {BODY {margin: 10%} }</style>
#+BIND: org-export-html-preamble-format (("en" "%d<br><a href=\"http://cecs.wright.edu/~pmateti/Courses/4420/\">Computer Security</a>"))
#+BIND: org-export-html-postamble-format (("en" "<hr size=1>Copyright &copy; 2013 &bull; <a href=\"http://www.wright.edu/~pmateti\"> www.wright.edu/~pmateti</a> &bull; %d"))


  Abstract:This lecture discusses viruses, worms, Trojans and other
  malware. We study the structure of these, and how virus removal
  programs work.

  Slides: virusPM.pptx  Stuxnet 2011

* Educational  Objectives

  1. Understand the technique of infection.

  1. Learn the virus removal techniques.

  1. Able to distinguish among viruses, worms and trojans.

  1. Understand the modern delivery of malware.


"Unix. The world's first computer virus."
Title of Chapter 1 of The Unix Haters Handbook, ISBN: 1-56884-203-1

  The above book is in fact written by serious computer
  scientists. Nevertheless, we must disregard the suggestion that
  Unix is a virus as an attempt at being hilarious. Equally
  unhelpful are the news media that use the term virus in referring
  to <i>any/ piece of malicious software. The academic world
  uses the term "malware'' for these. The <i>purpose/, not the
  approach, makes a program malicious. Many of the programs that
  fall in the malware categories have benevolent uses. For example,
  worms can be used to distribute computation on idle processors;
  back doors are useful for debugging programs; and viruses can be
  written to update source code and patch bugs. Rigorous
  definitions have been given by many computer security experts but
  they do not match the typical use even by other security experts.
  Thus, we must settle for "practical definitions" of malicious
  software.

* Malware
  
/Viruses/ are executable code pieces that modify other programs on a
computer, inserting copies of themselves.  Here we use the word
"program" in a very careful way: On Linux systems, the ELF document of
some 50-pages describes the format of the programs.  In this sense,
viruses are not programs -- they cannot run on their own, and need to
become part of some host program.  When such an infected program is
executed, the virus is designed to attach itself to another and so on.
Computer science use of the word is intended to mirror its use in
biology.

/Worms/ are independent programs that can travel from one machine
another using networking.

/Trojans/ replace their namesake but pristine programs.  Trojans are
programs that appear to have one function but actually perform another
function, like the famous horse of the Greek Trojan War.



** Virus Stats

** Stealth Virus

  A /stealth/ virus has code in it that seeks to conceal
  itself from discovery or defends itself against attempts to
  analyze or remove it. The stealth virus adds itself to a file or
  boot sector but, when you examine, it appears normal and
  unchanged. The stealth virus performs this trickery by staying in
  memory after it is executed. From there, it monitors and
  intercepts your system calls. When the system seeks to open an
  infected file, the stealth virus displays the uninfected version,
  thus hiding itself.

** Macro Viruses

  Macro languages are (often) equal in power to ordinary
  programming languages such as C. A program written in a macro
  language is interpreted by the application. Macro languages are
  conceptually no different from so-called scripting languages. Gnu
  Emacs uses Lisp, most Microsoft applications use Visual Basic
  Script as macro languages. The typical use of a macro in
  applications, such as MS Word, is to extend the features of the
  application. Some of these macros, known as auto-execute macros,
  are executed in response to some event, such as opening a file,
  closing a file, starting an application, and even pressing a
  certain key. A macro virus is a piece of self-replicating code
  inserted into an auto-execute macro. Once a macro is running, it
  copies itself to other documents, delete files, etc. Another type
  of hazardous macro is one named for an existing command of the
  application. For example, if a macro named FileSave exists in the
  "normal.dot" template of MS Word, that macro is executed whenever
  you choose the Save command on the File menu. Unfortunately,
  there is often no way to disable such features.

  In May 2000, an OutLook mail program macro virus called
  LOVELETTER propagated widely.

** Unix/Linux Viruses

  The most famous of the security incidents in the last decade
  was the Internet Worm incident which began from a Unix system.
  But Unix systems were considered virus-immune -- not so. Several
  Linux viruses have been discovered. The Staog virus first
  appeared in 1996 and was written in assembly language by the VLAD
  virus writing group, the same group responsible for creating the
  first Windows 95 virus called Boza.

  Like the Boza virus, the Staog virus is a proof-of-concept
  virus to demonstrate the potential of Linux virus writing without
  actually causing any real damage. Still, with the Staog assembly
  language source code floating around the Internet, other virus
  writers are likely to study and modify the code to create new
  strains of Linux viruses in the future.

  The second known Linux virus is called the Bliss virus. Unlike
  the Staog virus, the Bliss virus can not only spread in the wild,
  but also possesses a potentially dangerous payload that could
  wipe out data.

  While neither virus is a serious threat to Linux systems,
  Linux and other Unix systems will not remain virus-free.
  Fortunately, Linux virus writing is more difficult than macro
  virus writing for Windows, so the greatest virus threat still
  remains with Windows. [July 2000, <a href=
  "http://www.boardwatch.com/mag/2000/jul/bwm142pg2.htmlhttp://www.boardwatch
  .com/ mag/ 2000/ jul/ bwm142pg2.html</a> ]

