Courses/4420/Lectures/Viruses/viruses.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Malware: Viruses, Worms, Trojans, &hellip;</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Malware: Viruses, Worms, Trojans, &hellip;"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-11-24T15:01-0500"/>
<meta name="author" content="Prabhaker Mateti"/>
<meta name="description" content="Computer Security: Viruses, Worms, and Trojans"/>
<meta name="keywords" content=""/>

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="../Top/index.html"> UP </a>
 |
 <a accesskey="H" href="../Top/index.html"> HOME </a>
</div>

<div id="preamble">
2013-11-24T15:01-0500<br><a href="http://cecs.wright.edu/~pmateti/Courses/4420/">Computer Security</a>
</div>

<div id="content">
<h1 class="title">Malware: Viruses, Worms, Trojans, &hellip;</h1>



<p>
  Abstract:This lecture discusses viruses, worms, Trojans and other
  malware. We study the structure of these, and how virus removal
  programs work.
</p>
<p>
  Slides: virusPM.pptx  Stuxnet 2011
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Educational  Objectives</a></li>
<li><a href="#sec-2">2 Viruses</a>
<ul>
<li><a href="#sec-2-1">2.1 Virus Stats</a></li>
<li><a href="#sec-2-2">2.2 Stealth Virus</a></li>
<li><a href="#sec-2-3">2.3 Macro Viruses</a></li>
<li><a href="#sec-2-4">2.4 Unix/Linux Viruses</a></li>
<li><a href="#sec-2-5">2.5 Spreading Malware via the Internet</a></li>
</ul>
</li>
<li><a href="#sec-3">3 Famous Malware</a>
<ul>
<li><a href="#sec-3-1">3.1 The Morris Internet worm of 1988</a></li>
<li><a href="#sec-3-2">3.2 StuxNet Worm</a></li>
</ul>
</li>
<li><a href="#sec-4">4 Structure of Viruses</a></li>
<li><a href="#sec-5">5 Trojans</a></li>
<li><a href="#sec-6">6 Worms</a></li>
<li><a href="#sec-7">7 Malware Detection</a></li>
<li><a href="#sec-8">8 Malware Prevention</a></li>
<li><a href="#sec-9">9 Lab Experiment</a></li>
<li><a href="#sec-10">10 Acknowledgements</a></li>
<li><a href="#sec-11">11 Reading List</a>
<ul>
<li><a href="#sec-11-1">11.1 Required Reading</a></li>
<li><a href="#sec-11-2">11.2 Recommended Reading</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Educational  Objectives</h2>
<div class="outline-text-2" id="text-1">


<ol>
<li>Understand the technique of infection.

</li>
<li>Learn the virus removal techniques.

</li>
<li>Able to distinguish among viruses, worms and trojans.

</li>
<li>Understand the modern delivery of malware.
</li>
</ol>



<p>
"Unix. The world's first computer virus."
Title of Chapter 1 of The Unix Haters Handbook, ISBN: 1-56884-203-1
</p>
<p>
  The above book is in fact written by serious computer
  scientists. Nevertheless, we must disregard the suggestion that
  Unix is a virus as an attempt at being hilarious. Equally
  unhelpful are the news media that use the term virus in referring
  to &lt;i&gt;any/ piece of malicious software. The academic world
  uses the term "malware'' for these. The &lt;i&gt;purpose/, not the
  approach, makes a program malicious. Many of the programs that
  fall in the malware categories have benevolent uses. For example,
  worms can be used to distribute computation on idle processors;
  back doors are useful for debugging programs; and viruses can be
  written to update source code and patch bugs. Rigorous
  definitions have been given by many computer security experts but
  they do not match the typical use even by other security experts.
  Thus, we must settle for "practical definitions" of malicious
  software.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Viruses</h2>
<div class="outline-text-2" id="text-2">



<p>  
<i>Viruses</i> are executable code pieces that modify other programs on a
computer, inserting copies of themselves.  Here we use the word
"program" in a very careful way: On Linux systems, the ELF document of
some 50-pages describes the format of the programs.  In this sense,
viruses are not programs &ndash; they cannot run on their own, and need to
become part of some host program.  When such an infected program is
executed, the virus is designed to attach itself to another and so on.
Computer science use of the word is intended to mirror its use in
biology.
</p>

</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Virus Stats</h3>
<div class="outline-text-3" id="text-2-1">


</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Stealth Virus</h3>
<div class="outline-text-3" id="text-2-2">


<p>
  A <i>stealth</i> virus has code in it that seeks to conceal
  itself from discovery or defends itself against attempts to
  analyze or remove it. The stealth virus adds itself to a file or
  boot sector but, when you examine, it appears normal and
  unchanged. The stealth virus performs this trickery by staying in
  memory after it is executed. From there, it monitors and
  intercepts your system calls. When the system seeks to open an
  infected file, the stealth virus displays the uninfected version,
  thus hiding itself.
</p>
</div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Macro Viruses</h3>
<div class="outline-text-3" id="text-2-3">


<p>
  Macro languages are (often) equal in power to ordinary
  programming languages such as C. A program written in a macro
  language is interpreted by the application. Macro languages are
  conceptually no different from so-called scripting languages. Gnu
  Emacs uses Lisp, most Microsoft applications use Visual Basic
  Script as macro languages. The typical use of a macro in
  applications, such as MS Word, is to extend the features of the
  application. Some of these macros, known as auto-execute macros,
  are executed in response to some event, such as opening a file,
  closing a file, starting an application, and even pressing a
  certain key. A macro virus is a piece of self-replicating code
  inserted into an auto-execute macro. Once a macro is running, it
  copies itself to other documents, delete files, etc. Another type
  of hazardous macro is one named for an existing command of the
  application. For example, if a macro named FileSave exists in the
  "normal.dot" template of MS Word, that macro is executed whenever
  you choose the Save command on the File menu. Unfortunately,
  there is often no way to disable such features.
</p>
<p>
  In May 2000, an OutLook mail program macro virus called
  LOVELETTER propagated widely.
</p>
</div>

</div>

<div id="outline-container-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> Unix/Linux Viruses</h3>
<div class="outline-text-3" id="text-2-4">


<p>
  The most famous of the security incidents in the last decade
  was the Internet Worm incident which began from a Unix system.
  But Unix systems were considered virus-immune &ndash; not so. Several
  Linux viruses have been discovered. The Staog virus first
  appeared in 1996 and was written in assembly language by the VLAD
  virus writing group, the same group responsible for creating the
  first Windows 95 virus called Boza.
</p>
<p>
  Like the Boza virus, the Staog virus is a proof-of-concept
  virus to demonstrate the potential of Linux virus writing without
  actually causing any real damage. Still, with the Staog assembly
  language source code floating around the Internet, other virus
  writers are likely to study and modify the code to create new
  strains of Linux viruses in the future.
</p>
<p>
  The second known Linux virus is called the Bliss virus. Unlike
  the Staog virus, the Bliss virus can not only spread in the wild,
  but also possesses a potentially dangerous payload that could
  wipe out data.
</p>
<p>
  While neither virus is a serious threat to Linux systems,
  Linux and other Unix systems will not remain virus-free.
  Fortunately, Linux virus writing is more difficult than macro
  virus writing for Windows, so the greatest virus threat still
  remains with Windows. [July 2000, &lt;a href=
  "<a href="http://www.boardwatch.com/mag/2000/jul/bwm142pg2.htmlhttp://www.boardwatch">http://www.boardwatch.com/mag/2000/jul/bwm142pg2.htmlhttp://www.boardwatch</a>
  .com/ mag/ 2000/ jul/ bwm142pg2.html&lt;/a&gt; ]
</p>
</div>

</div>
