Courses/4420/Lectures/Viruses/viruses.org
** Spreading Malware via the Internet

  Whereas a Trojan horse is delivered pre-built, a virus
  infects. In the past, such malicious programs arrived via tapes
  and disks, and the spread of a virus around the world took many
  months. Antivirus companies had time to identify a new viral
  strain, and create cleaning procedures. Today, Trojan horses, and
  viruses are network deliverable as E-mail, Java applets, ActiveX
  controls, JavaScripted pages, CGI-BIN scripts, or as
  self-extracting packages.

  Integrated mail systems such as Microsoft Outlook make it very
  simple to send not only a quick note edited within a limited text
  editor but also previously composed computer documents of
  arbitrary complexity to anyone, and to work with objects that you
  receive via standards such as MIME. They also support application
  programming interfaces (such as MAPI) that allow programs to send
  and process mail automatically. Well over 500 million E-mail
  messages are delivered daily in July 2000.

  Mobile-program systems are becoming more and more widespread.
  The most widely-hyped examples today are Java and ActiveX. This
  technology became popular with Web servers and browsers, but it
  is now integrated (e.g., Java into Lotus Notes, and ActiveX into
  Outlook) mail systems. Both Java and ActiveX have been found to
  have security bugs.

* Famous Malware

** The Morris Internet worm of 1988


  The http://en.wikipedia.org/wiki/Morris_worm Morris
    worm</a> has been extensively analyzed as it was perhaps the first
    worm to use Internet to spread out.  Of course, the Internet of
    1988 was only few thousand nodes.  Robert Tappan Morris was
    convicted and sentenced to three years of probation, 400 hours of
    community service, a fine of $10,050, etc.


** StuxNet Worm

  Popular media often labelled the
    http://en.wikipedia.org/wiki/Stuxnet StuxNet</a> of
    2010 as a virus, but it is a worm.  There is a
    http://www.ted.com/talks/ralph_langner_cracking_stuxnet_a_21st_century_cyberweapon.html
TED talk</a> (Ralph Langner, "Cracking Stuxnet, a 21st-Century Cyber
    Weapon", Mar 31, 2011).  Read also:
http://securitywatch.pcmag.com/none/296603-report-stuxnet-worm-was-planted-by-an-iranian-secret-agent
  http://securitywatch.pcmag.com/none/296603-report-stuxnet-worm-was-planted-by-an-iranian-secret-agent</a> Apr 13, 2012.
http://midsizeinsider.com/en-us/article/researchers-release-stuxnet-like-exploit http://midsizeinsider.com/en-us/article/researchers-release-stuxnet-like-exploit</a>

Researchers Release Stuxnet-Like Exploits on Metasploit
http://abcnews.go.com/blogs/headlines/2012/03/new-version-of-stuxnet-related-cyber-weapon-discovered/ http://abcnews.go.com/blogs/headlines/2012/03/new-version-of-stuxnet-related-cyber-weapon-discovered/</a> Mar 23, 2012.

Langner


* Structure of Viruses

  Here is a simple structure of a virus. In the infected binary,
  at a known byte location in the file, a virus inserts a signature
  byte used to determine if a potential carrier program has been
  previously infected.

#+begin_src C
V()
{
  infectExecutable();
  if (triggered()) {
    doDamage();
  }
  jump to main of infected program;
}

void infectExecutable()
{
 file = chose an uninfected executable file;
 prepend V to file;
}

void doDamage() {
   ...
}

int triggered()
{
  return (some test? 1 : 0);
}
#+end_src

  The above virus makes the infected file longer than it was,
  making it easy to spot. There are many techniques to leave the
  file length and even a check sum unchanged and yet infect. For
  example, many executable files often contain long sequences of
  zero bytes, which can be replaced by the virus and re-generated.
  It is also possible to compress the original executable code like
  the typical Zip programs do, and uncompress before execution and
  pad with bytes so that the check sum comes out to be what it
  was.

* Trojans



