Courses/4420/Lectures/Viruses/viruses.html

<div id="outline-container-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> Spreading Malware via the Internet</h3>
<div class="outline-text-3" id="text-2-5">


<p>
  Whereas a Trojan horse is delivered pre-built, a virus
  infects. In the past, such malicious programs arrived via tapes
  and disks, and the spread of a virus around the world took many
  months. Antivirus companies had time to identify a new viral
  strain, and create cleaning procedures. Today, Trojan horses, and
  viruses are network deliverable as E-mail, Java applets, ActiveX
  controls, JavaScripted pages, CGI-BIN scripts, or as
  self-extracting packages.
</p>
<p>
  Integrated mail systems such as Microsoft Outlook make it very
  simple to send not only a quick note edited within a limited text
  editor but also previously composed computer documents of
  arbitrary complexity to anyone, and to work with objects that you
  receive via standards such as MIME. They also support application
  programming interfaces (such as MAPI) that allow programs to send
  and process mail automatically. Well over 500 million E-mail
  messages are delivered daily in July 2000.
</p>
<p>
  Mobile-program systems are becoming more and more widespread.
  The most widely-hyped examples today are Java and ActiveX. This
  technology became popular with Web servers and browsers, but it
  is now integrated (e.g., Java into Lotus Notes, and ActiveX into
  Outlook) mail systems. Both Java and ActiveX have been found to
  have security bugs.
</p>
</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Famous Malware</h2>
<div class="outline-text-2" id="text-3">



</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> The Morris Internet worm of 1988</h3>
<div class="outline-text-3" id="text-3-1">



<p>
  The <a href="http://en.wikipedia.org/wiki/Morris_worm">http://en.wikipedia.org/wiki/Morris_worm</a> Morris
    worm&lt;/a&gt; has been extensively analyzed as it was perhaps the first
    worm to use Internet to spread out.  Of course, the Internet of
    1988 was only few thousand nodes.  Robert Tappan Morris was
    convicted and sentenced to three years of probation, 400 hours of
    community service, a fine of $10,050, etc.
</p>

</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> StuxNet Worm</h3>
<div class="outline-text-3" id="text-3-2">


<p>
  Popular media often labelled the
    <a href="http://en.wikipedia.org/wiki/Stuxnet">http://en.wikipedia.org/wiki/Stuxnet</a> StuxNet&lt;/a&gt; of
    2010 as a virus, but it is a worm.  There is a
    <a href="http://www.ted.com/talks/ralph_langner_cracking_stuxnet_a_21st_century_cyberweapon.html">http://www.ted.com/talks/ralph_langner_cracking_stuxnet_a_21st_century_cyberweapon.html</a>
TED talk&lt;/a&gt; (Ralph Langner, "Cracking Stuxnet, a 21st-Century Cyber
    Weapon", Mar 31, 2011).  Read also:
<a href="http://securitywatch.pcmag.com/none/296603-report-stuxnet-worm-was-planted-by-an-iranian-secret-agent">http://securitywatch.pcmag.com/none/296603-report-stuxnet-worm-was-planted-by-an-iranian-secret-agent</a>
  <a href="http://securitywatch.pcmag.com/none/296603-report-stuxnet-worm-was-planted-by-an-iranian-secret-agent">http://securitywatch.pcmag.com/none/296603-report-stuxnet-worm-was-planted-by-an-iranian-secret-agent</a>&lt;/a&gt; Apr 13, 2012.
<a href="http://midsizeinsider.com/en-us/article/researchers-release-stuxnet-like-exploit">http://midsizeinsider.com/en-us/article/researchers-release-stuxnet-like-exploit</a> <a href="http://midsizeinsider.com/en-us/article/researchers-release-stuxnet-like-exploit">http://midsizeinsider.com/en-us/article/researchers-release-stuxnet-like-exploit</a>&lt;/a&gt;
</p>
<p>
Researchers Release Stuxnet-Like Exploits on Metasploit
<a href="http://abcnews.go.com/blogs/headlines/2012/03/new-version-of-stuxnet-related-cyber-weapon-discovered/">http://abcnews.go.com/blogs/headlines/2012/03/new-version-of-stuxnet-related-cyber-weapon-discovered/</a> <a href="http://abcnews.go.com/blogs/headlines/2012/03/new-version-of-stuxnet-related-cyber-weapon-discovered/">http://abcnews.go.com/blogs/headlines/2012/03/new-version-of-stuxnet-related-cyber-weapon-discovered/</a>&lt;/a&gt; Mar 23, 2012.
</p>
<p>
Langner
</p>

</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Structure of Viruses</h2>
<div class="outline-text-2" id="text-4">


<p>
  Here is a simple structure of a virus. In the infected binary,
  at a known byte location in the file, a virus inserts a signature
  byte used to determine if a potential carrier program has been
  previously infected.
</p>



<pre class="src src-C"><span style="color: #0000ff;">V</span>()
{
  infectExecutable();
  <span style="color: #a020f0;">if</span> (triggered()) {
    doDamage();
  }
  jump to main of <span style="color: #228b22;">infected</span> <span style="color: #a0522d;">program</span>;
}

<span style="color: #228b22;">void</span> <span style="color: #0000ff;">infectExecutable</span>()
{
 file = chose an uninfected executable file;
 prepend V <span style="color: #228b22;">to</span> <span style="color: #a0522d;">file</span>;
}

<span style="color: #228b22;">void</span> <span style="color: #0000ff;">doDamage</span>() {
   ...
}

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">triggered</span>()
{
  <span style="color: #a020f0;">return</span> (<span style="color: #228b22;">some</span> <span style="color: #a0522d;">test</span>? 1 : 0);
}
</pre>


<p>
  The above virus makes the infected file longer than it was,
  making it easy to spot. There are many techniques to leave the
  file length and even a check sum unchanged and yet infect. For
  example, many executable files often contain long sequences of
  zero bytes, which can be replaced by the virus and re-generated.
  It is also possible to compress the original executable code like
  the typical Zip programs do, and uncompress before execution and
  pad with bytes so that the check sum comes out to be what it
  was.
</p>
</div>

</div>
