Courses/4420/Lectures/Viruses/viruses.org
* Malware Detection

  Known viruses are by far the most common security problem on
  modern computer systems. Several web sites maintain complete
  lists of known viruses. There are thousands. Visit, e.g.,
  http://www.cai.com/virusinfo/encyclopedia/www.cai.com/
  virusinfo/ encyclopedia/</a>. In the month of July 2000, there
  were 200+ "PC Viruses in the Wild" (<a href=
  "http://www.wildlist.org/www. wildlist. org</a>). Virus
  detection programs analyze a suspect program for the presence of
  known viruses.

  Fred Cohen has proven mathematically that perfect detection of
  unknown viruses is impossible: no program can look at other
  programs and say either "a virus is present" or "no virus is
  present", and always be correct. But, in the real world, most new
  viruses are sufficiently like old viruses that the same sort of
  scanning that finds known viruses also finds the new ones. And
  there are a large number of heuristic tricks that anti-virus
  programs use to detect new viruses, based either on how they
  look, or what they do. These heuristics are only sometimes
  successful, but since brand-new viruses are comparatively rare,
  they are sufficient to the purpose.

  Virus scanners are sometimes classified by their "generation."
  The first generation virus scanners used previously obtained a
  virus signature, a bit pattern, to detect a known virus. They
  record and check the length of all executables. The second
  generation scans executables with heuristic rules, looking, e.g.,
  for fragments of code associated with a typical virus. They also
  do integrity checking by calculating a checksum of a program and
  storing somewhere else the encrypted checksum. The third
  generation use a memory resident program to monitor the execution
  behavior of programs to identify a virus by the types of action
  that the virus takes. The fourth Generation Virus Detection
  combines all previous approaches and includes access control
  capabilities.

  It is very educational to study the details of a scanner. The
  paper by Sandeep Kumar, and Gene Spafford, "A Generic Virus
  Scanner in C++," Proceedings of the 8th Computer Security
  Applications Conference, IEEEPress, Piscataway, NJ; pp.210-219,
  2-4 Dec 1992 [virusScanner.pdfLocal copy .pdf</a>] is
  Required Reading.

  <h1>2. <a name="Worms" id="WormsWorms</a></h1>A /worm/ is a
  malicious program that copies itself from one computer to another on
  a network. A worm is an independent program, in the sense described
  above, unlike a virus which is a part-program that must insert
  itself into a whole-program. A worm typically does not modify other
  programs. A typical worm may carry other code, including programs
  and viruses.  We describe just two famous worms.


* Malware Prevention

* Lab Experiment

  1. Study the paper
     http://www.research.ibm.com/antivirus/SciPapers/VB2000DC.htm An
    Undetectable Computer Virus</a>, 2000. Construct a virus as
    described. Which of the typical ant-virus scanners detect
    this?

* Acknowledgements

  These lecture materials are gleaned from many sources. All are
  presented after careful reading. In some cases, I may have
  neglected proper attribution. I assure the reader it is not
  because I claim authorship. Indeed, in the lectures there is
  hardly any thing new that I have contributed. Suggestions for
  improvement are always welcome.

* Reading List

** Required Reading



  1. Simson Garfinkel, Gene Spafford, Practical Unix and
    Internet Security, 3rd edition (2003), O'Reilly &amp;
    Associates; ISBN: 0596003234. Chapter on Protecting Against
    Programmed Threats. Required Reading.

  1. Sandeep Kumar, and Gene Spafford, "A Generic Virus Scanner
    in C++," Proceedings of the 8th Computer Security Applications
    Conference; IEEEPress, Piscataway, NJ; pp.210-219, 2-4 Dec
    1992. [virusScanner.pdfLocal copy .pdf</a>] Required
    Reading.

  1. Ozgun Erdogan and Pei Cao, Hash-AV: fast virus signature
    scanning by cache-resident filters, International Journal of
    Security and Networks, Volume 2, Number 1-2 / 2007 Pages: 50 -
    59. Recommended Reading.

  1. Anthony Cheuk Tung Lai, "Comprehensive Blended Malware
    Threat Dissection Analyze Fake Anti-Virus Software and PDF
    Payloads", 2010, <a href=
    "http://www.sans.org/reading_room/http://www.sans.org/reading_room/</a>
    Recommended Reading.<br>
    Bryan Barber, " Cheese Worm: Pros and Cons of a Friendly Worm",
    2003, <a href=
    "http://www.sans.org/reading_room/http://www.sans.org/reading_room/</a>
    Recommended Reading.

  1. Schaffer, G.P., Worms and viruses and botnets, oh my!
    Rational responses to emerging Internet threats, <a href=
    "http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=8013Security
    &amp; Privacy, IEEE</a>, May-June 2006, Volume: 4, <a href=
    "http://ieeexplore.ieee.org/xpl/tocresult.jsp?isnumber=34312&amp;isYear=2006
    Issue: 3</a>, pp. 52-58. Recommended Reading.

  1. http://vxheavens.com/http://vxheavens.com/</a>
    Their slogan: "Viruses don't harm, ignorance does!" Collection
    of viruses source code.

  1. Dark Angel, &ldquo;(Phalcon/Skism) Virus Writing
    Tutorials,&rdquo; <a href=
    "http://www.sirkussystem.com/virus.html
    http://www.sirkussystem.com/virus.html</a> Required Reading.

  1. Mihai Christodorescu, Somesh Jha, Douglas Maughan, Dawn
    Song, and Cliff Wang, /Malware detection/, Springer, 2010
    ISBN-10: 1441940952 324 pages.  Reference

** Recommended Reading

1. Virus Bulletin, http://www.virusbtn.com/ Technical journal on
   developments in the field of computer viruses and anti-virus
   products.  Reference.

1. Thimbleby, Harold, Stuart Anderson, and Paul Cairns. "A framework
   for modelling trojans and computer virus infection." The Computer
   Journal 41.7 (1998): 444-458.

1. Hypponen, Mikko. "Malware goes mobile." Scientific American 295.5
   (2006): 70-77.

1.  Cerf, Vinton G.  Google "Defense against the Dark Arts"
    Programmers must understand the mechanisms of malware attacks if
    they're to defend against them. Some believe programmers should
    also be taught and even practice both attacks and defense under
    controlled conditions. The notion of practicing attacks and
    writing malware is controversial. Further development of forensic
    tools and learning to use them will complement a curriculum
    designed to prepare programmers for a hostile environment,
    especially in public networks such as the Internet.  Internet
    Computing, IEEE (Volume:16 , Issue: 1 )

1.  Mikko H. Hypponen, "The History and Evolution of Computer
    Viruses," Defcon 19, https://www.youtube.com/watch?v=Xr0ESMH1hwY, 2012

# -eof-
