Courses/4420/Lectures/Viruses/viruses.html

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Trojans</h2>
<div class="outline-text-2" id="text-5">


<p>
<i>Trojans</i> replace their namesake but pristine programs.  Trojans are
programs that appear to have one function but actually perform another
function, like the famous horse of the Greek Trojan War.
</p>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Worms</h2>
<div class="outline-text-2" id="text-6">


<p>
<i>Worms</i> are independent programs that can travel from one machine
another using networking.
</p>
</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Malware Detection</h2>
<div class="outline-text-2" id="text-7">


<p>
  Known viruses are by far the most common security problem on
  modern computer systems. Several web sites maintain complete
  lists of known viruses. There are thousands. Visit, e.g.,
  <a href="http://www.cai.com/virusinfo/encyclopedia/www.cai.com/">http://www.cai.com/virusinfo/encyclopedia/www.cai.com/</a>
  virusinfo/ encyclopedia/&lt;/a&gt;. In the month of July 2000, there
  were 200+ "PC Viruses in the Wild" (&lt;a href=
  "<a href="http://www.wildlist.org/www">http://www.wildlist.org/www</a>. wildlist. org&lt;/a&gt;). Virus
  detection programs analyze a suspect program for the presence of
  known viruses.
</p>
<p>
  Fred Cohen has proven mathematically that perfect detection of
  unknown viruses is impossible: no program can look at other
  programs and say either "a virus is present" or "no virus is
  present", and always be correct. But, in the real world, most new
  viruses are sufficiently like old viruses that the same sort of
  scanning that finds known viruses also finds the new ones. And
  there are a large number of heuristic tricks that anti-virus
  programs use to detect new viruses, based either on how they
  look, or what they do. These heuristics are only sometimes
  successful, but since brand-new viruses are comparatively rare,
  they are sufficient to the purpose.
</p>
<p>
  Virus scanners are sometimes classified by their "generation."
  The first generation virus scanners used previously obtained a
  virus signature, a bit pattern, to detect a known virus. They
  record and check the length of all executables. The second
  generation scans executables with heuristic rules, looking, e.g.,
  for fragments of code associated with a typical virus. They also
  do integrity checking by calculating a checksum of a program and
  storing somewhere else the encrypted checksum. The third
  generation use a memory resident program to monitor the execution
  behavior of programs to identify a virus by the types of action
  that the virus takes. The fourth Generation Virus Detection
  combines all previous approaches and includes access control
  capabilities.
</p>
<p>
  It is very educational to study the details of a scanner. The
  paper by Sandeep Kumar, and Gene Spafford, "A Generic Virus
  Scanner in C++," Proceedings of the 8th Computer Security
  Applications Conference, IEEEPress, Piscataway, NJ; pp.210-219,
  2-4 Dec 1992 [virusScanner.pdfLocal copy .pdf&lt;/a&gt;] is
  Required Reading.
</p>
<p>
  &lt;h1&gt;2. &lt;a name="Worms" id="WormsWorms&lt;/a&gt;&lt;/h1&gt;A <i>worm</i> is a
  malicious program that copies itself from one computer to another on
  a network. A worm is an independent program, in the sense described
  above, unlike a virus which is a part-program that must insert
  itself into a whole-program. A worm typically does not modify other
  programs. A typical worm may carry other code, including programs
  and viruses.  We describe just two famous worms.
</p>

</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Malware Prevention</h2>
<div class="outline-text-2" id="text-8">


</div>

</div>

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> Lab Experiment</h2>
<div class="outline-text-2" id="text-9">


<ol>
<li>Study the paper
     <a href="http://www.research.ibm.com/antivirus/SciPapers/VB2000DC.htm">http://www.research.ibm.com/antivirus/SciPapers/VB2000DC.htm</a> An
    Undetectable Computer Virus&lt;/a&gt;, 2000. Construct a virus as
    described. Which of the typical ant-virus scanners detect
    this?
</li>
</ol>


</div>

</div>

<div id="outline-container-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> Acknowledgements</h2>
<div class="outline-text-2" id="text-10">


<p>
  These lecture materials are gleaned from many sources. All are
  presented after careful reading. In some cases, I may have
  neglected proper attribution. I assure the reader it is not
  because I claim authorship. Indeed, in the lectures there is
  hardly any thing new that I have contributed. Suggestions for
  improvement are always welcome.
</p>
</div>

</div>

<div id="outline-container-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> Reading List</h2>
<div class="outline-text-2" id="text-11">



</div>

<div id="outline-container-11-1" class="outline-3">
<h3 id="sec-11-1"><span class="section-number-3">11.1</span> Required Reading</h3>
<div class="outline-text-3" id="text-11-1">




<ol>
<li>Simson Garfinkel, Gene Spafford, Practical Unix and
    Internet Security, 3rd edition (2003), O'Reilly &amp;amp;
    Associates; ISBN: 0596003234. Chapter on Protecting Against
    Programmed Threats. Required Reading.

</li>
<li>Sandeep Kumar, and Gene Spafford, "A Generic Virus Scanner
    in C++," Proceedings of the 8th Computer Security Applications
    Conference; IEEEPress, Piscataway, NJ; pp.210-219, 2-4 Dec
<ol>
<li>[virusScanner.pdfLocal copy .pdf&lt;/a&gt;] Required
</li>
</ol>

<p>    Reading.
</p>
</li>
<li>Ozgun Erdogan and Pei Cao, Hash-AV: fast virus signature
    scanning by cache-resident filters, International Journal of
    Security and Networks, Volume 2, Number 1-2 / 2007 Pages: 50 -
<ol>
<li>Recommended Reading.

</li>
</ol>

</li>
<li>Anthony Cheuk Tung Lai, "Comprehensive Blended Malware
    Threat Dissection Analyze Fake Anti-Virus Software and PDF
    Payloads", 2010, &lt;a href=
    "<a href="http://www.sans.org/reading_room/http://www.sans.org/reading_room/">http://www.sans.org/reading_room/http://www.sans.org/reading_room/</a>&lt;/a&gt;
    Recommended Reading.&lt;br&gt;
    Bryan Barber, " Cheese Worm: Pros and Cons of a Friendly Worm",
    2003, &lt;a href=
    "<a href="http://www.sans.org/reading_room/http://www.sans.org/reading_room/">http://www.sans.org/reading_room/http://www.sans.org/reading_room/</a>&lt;/a&gt;
    Recommended Reading.

</li>
<li>Schaffer, G.P., Worms and viruses and botnets, oh my!
    Rational responses to emerging Internet threats, &lt;a href=
    "<a href="http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=8013Security">http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=8013Security</a>
    &amp;amp; Privacy, IEEE&lt;/a&gt;, May-June 2006, Volume: 4, &lt;a href=
    "<a href="http://ieeexplore.ieee.org/xpl/tocresult.jsp?isnumber=34312&amp;amp;isYear=2006">http://ieeexplore.ieee.org/xpl/tocresult.jsp?isnumber=34312&amp;amp;isYear=2006</a>
    Issue: 3&lt;/a&gt;, pp. 52-58. Recommended Reading.

</li>
<li><a href="http://vxheavens.com/http://vxheavens.com/">http://vxheavens.com/http://vxheavens.com/</a>&lt;/a&gt;
    Their slogan: "Viruses don't harm, ignorance does!" Collection
    of viruses source code.

</li>
<li>Dark Angel, &amp;ldquo;(Phalcon/Skism) Virus Writing
    Tutorials,&amp;rdquo; &lt;a href=
    "<a href="http://www.sirkussystem.com/virus.html">http://www.sirkussystem.com/virus.html</a>
    <a href="http://www.sirkussystem.com/virus.html">http://www.sirkussystem.com/virus.html</a>&lt;/a&gt; Required Reading.

</li>
<li>Mihai Christodorescu, Somesh Jha, Douglas Maughan, Dawn
    Song, and Cliff Wang, <i>Malware detection</i>, Springer, 2010
    ISBN-10: 1441940952 324 pages.  Reference
</li>
</ol>


</div>

</div>

<div id="outline-container-11-2" class="outline-3">
<h3 id="sec-11-2"><span class="section-number-3">11.2</span> Recommended Reading</h3>
<div class="outline-text-3" id="text-11-2">


<ol>
<li>Virus Bulletin, <a href="http://www.virusbtn.com/">http://www.virusbtn.com/</a> Technical journal on
   developments in the field of computer viruses and anti-virus
   products.  Reference.
</li>
</ol>




</div>
</div>
</div>
</div>

<div id="postamble">
<hr size=1>Copyright &copy; 2013 &bull; <a href="http://www.wright.edu/~pmateti"> www.wright.edu/~pmateti</a> &bull; 2013-11-24T15:01-0500
</div>
</body>
</html>
